tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "osx-cross/avr"
tap "px4/px4"
brew "ack"
brew "atomicparsley"
brew "autoconf"
brew "autojump"
brew "automake"
brew "avrdude"
brew "aws-iam-authenticator"
brew "sqlite"
brew "awscli"
brew "bats"
brew "coreutils"
brew "curl"
brew "dfu-programmer"
brew "ffmpeg"
brew "gist"
brew "git"
brew "git-secrets"
brew "go"
brew "hub"
brew "hugo"
brew "jq"
brew "kubernetes-cli"
brew "lzop"
brew "mosh"
brew "mtr"
brew "nmap"
brew "node"
brew "parallel"
brew "pigz"
brew "pipenv"
brew "postgresql", restart_service: true
brew "pstree"
brew "pv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rbenv"
brew "rbenv-default-gems"
brew "shellcheck"
brew "socat"
brew "ssh-copy-id"
brew "tcpdump"
brew "tcptrace"
brew "tcptraceroute"
brew "teensy_loader_cli"
brew "terraform"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tree"
brew "unrar"
brew "vim"
brew "watch"
brew "wget"
brew "youtube-dl"
brew "zlib"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "heroku/brew/heroku"
brew "osx-cross/avr/avr-gcc"
brew "px4/px4/gcc-arm-none-eabi"
cask "asset-catalog-tinkerer"
cask "aws-vault"
cask "font-fira-code"
cask "mactex"
cask "now"
