ack
asciidoc
autojump
awscli
bats
coreutils
curl
ffmpeg
gawk
gist
git
gnu-sed
heroku
httpie
hub
jq
libdvdcss
libffi
libyaml
lzlib
lzop
macvim
mtr
nmap
nuget
parallel
pigz
postgis
pstree
pv
python
python3
rbenv
rbenv-default-gems
redis
s3cmd
shellcheck
socat
ssh-copy-id
sysdig
tcptraceroute
the_silver_searcher
tmux
tree
truncate
watch
wget
youtube-dl
zsh
zsh-completions
zsh-syntax-highlighting
